mclaughlinpeter/STM32/STM32_IPL/Core/Src/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @author  MCD Application Team
 * @brief   Main program body for Cortex-M7.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32h747i_discovery.h"
#include "stm32h747i_discovery_bus.h"
#include "stm32h747i_discovery_camera.h"
#include "stm32h747i_discovery_camera_ex.h"
#include "stm32h747i_discovery_sdram.h"
#include "jpeg_utils.h"
#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_video.h"
#include "usbd_video_if.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define MAX_WIDTH (640)
#define MAX_HEIGHT (480)
#define MAX_NUM_PIXELS (MAX_WIDTH * MAX_HEIGHT)
#define CAMERA_BITS_PER_PX 16U
#define YCBCR_BITS_PER_PX 16U /* 422 */
#define JPEG_SUBSAMPLING JPEG_422_SUBSAMPLING
#define CAMERA_LINE_SIZE (MAX_WIDTH * CAMERA_BITS_PER_PX / 8)
#define CAMERA_BUFF_SIZE (MAX_NUM_PIXELS * CAMERA_BITS_PER_PX / 8)
#define YCBCR_BUFF_SIZE (MAX_NUM_PIXELS * YCBCR_BITS_PER_PX / 8)

#define JPEG_MAX_SIZE YCBCR_BUFF_SIZE

/* JPEG encoding image quality in % */
#define JPEG_QUALITY 90U

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/*
 * Frame buffers
 * 32-byte alignment buffer for cache coherency operations
 * Bank separation for SDRAM bandwith optimization (4x8MB SDRAM banks)
 */
uint8_t pCameraLineBuffer[CAMERA_LINE_SIZE] __attribute__((aligned(32), section(".sram1")));
uint8_t pCameraBuff[CAMERA_BUFF_SIZE] __attribute__((aligned(32), section(".sdram_bank1")));
uint8_t pCopiedBuff[CAMERA_BUFF_SIZE] __attribute__((aligned(32), section(".sdram_bank2")));
uint8_t pYCbCrBuff[YCBCR_BUFF_SIZE] __attribute__((aligned(32), section(".sdram_bank2")));
uint8_t pJpegBuff[JPEG_MAX_SIZE] __attribute__((aligned(32), section(".sdram_bank2")));

// STM32 IPL buffer
uint8_t stm32iplBuffer[STM32IPL_INT_BUFFER_SIZE] __attribute__((aligned(32), section(".sdram_bank2")));

USBD_HandleTypeDef husb;
JPEG_HandleTypeDef hjpeg;
MDMA_HandleTypeDef hmdma;
volatile uint32_t jpg_img_size;
volatile uint32_t camera_capture_complete;

/* Private function prototypes -----------------------------------------------*/
static void MPU_Config(void);
static void CPU_CACHE_Enable(void);
static void SystemClock_Config(void);
static void Error_Handler(void);
static void USB_Init(void);
static void MDMA_Init(void);

static void JPEG_Init(void);
static void JPEG_Encode(uint8_t *pSrc, uint8_t *pDst, uint32_t size);
static uint32_t JPEG_RGBToYCbCr(uint8_t *pSrc, uint8_t *pDst);
static JPEG_RGBToYCbCr_Convert_Function RGBToYCbCr;

static void CAMERA_SetMode(void);

/* Private functions ---------------------------------------------------------*/
HAL_StatusTypeDef HAL_DCMIEx_Start_DMA_MDMA(DCMI_HandleTypeDef *hdcmi, uint32_t DCMI_Mode, uint8_t *pData,
											uint32_t line_size, uint32_t num_lines);
static void DCMI_DMALineXferCplt(DMA_HandleTypeDef *hdma);
static void DCMI_DMAError(DMA_HandleTypeDef *hdma);
static void DCMI_MDMAFrameXferCplt(MDMA_HandleTypeDef *hmdma);
static void DCMI_MDMAError(MDMA_HandleTypeDef *hmdma);

/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main(void)
{
	/* Configure the MPU attributes as Write Through for SDRAM */
	MPU_Config();

	/* Enable the CPU Cache */
	CPU_CACHE_Enable();

	/* STM32H7xx HAL library initialization:
	   - Systick timer is configured by default as source of time base, but user
		 can eventually implement his proper time base source (a general purpose
		 timer for example or other time source), keeping in mind that Time base
		 duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and
		 handled in milliseconds basis.
	   - Set NVIC Group Priority to 4
	   - Low Level Initialization
	 */
	HAL_Init();

	/* Configure the system clock */
	SystemClock_Config();

	BSP_LED_Init(LED1);
	BSP_LED_Init(LED2);

	BSP_SDRAM_Init(0);

	// setup STM IPL
	STM32Ipl_InitLib(stm32iplBuffer, STM32IPL_INT_BUFFER_SIZE);
	list_t thresholds;
	list_init(&thresholds, sizeof(color_thresholds_list_lnk_data_t));
	color_thresholds_list_lnk_data_t lnk_data;
	lnk_data.LMin = 0;
	lnk_data.LMax = 25;
	lnk_data.AMin = 0;
	lnk_data.AMax = 25;
	lnk_data.BMin = 0;
	lnk_data.BMax = 25;
	list_push_back(&thresholds, &lnk_data);

	/* Init camera default resolution and format */
	if (BSP_CAMERA_Init(0, CAMERA_R640x480, CAMERA_PF_RGB565) != BSP_ERROR_NONE)
	{
		Error_Handler();
	}

	/* Init MDMA for camera line buffer to frame buffer copy */
	MDMA_Init();

	USB_Init();

	CAMERA_SetMode();

	// explore driver
	BSP_CAMERA_SetBrightness(0, 0);
	int32_t brightness;
	BSP_CAMERA_GetBrightness(0, &brightness);
	uint32_t PixelFormat;
	BSP_CAMERA_GetPixelFormat(0, &PixelFormat);

	BSP_CAMERA_SetPixelFormat(0, CAMERA_PF_RGB565);
	uint32_t pixelFormatRead;
	BSP_CAMERA_GetPixelFormat(0, &pixelFormatRead);

	BSP_CAMERA_SetResolution(0, CAMERA_R640x480);
	uint32_t Resolution;
	BSP_CAMERA_GetResolution(0, &Resolution);

	// int32_t ret = BSP_CAMERA_SetMirrorFlip(0, OV5640_MIRROR_FLIP);
	uint32_t MirrorFlip;
	BSP_CAMERA_GetMirrorFlip(0, &MirrorFlip);

	BSP_CAMERAEx_SetTiming(0, CAMERA_TIMING_12FPS);

	// BSP_CAMERA_SetColorbarModeConfig(0, COLORBAR_MODE_ENABLE);

	// if (ret != BSP_ERROR_NONE)
	// {
	// 	Error_Handler();
	// }

	stm32ipl_err_t resultIpl;

	image_t imgSrc;
	STM32Ipl_Init(&imgSrc, MAX_WIDTH, MAX_HEIGHT, IMAGE_BPP_RGB565, pCopiedBuff);

	image_t imgDst;
	resultIpl = STM32Ipl_AllocData(&imgDst, MAX_WIDTH, MAX_HEIGHT, IMAGE_BPP_RGB565);
	if (resultIpl != stm32ipl_err_Ok)
	{
		Error_Handler();
	}

