mclaughlinpeter/STM32/STM32_IPL/Core/Src/main.c
	image_t imgDst2;
	resultIpl = STM32Ipl_AllocData(&imgDst2, MAX_WIDTH, MAX_HEIGHT, IMAGE_BPP_RGB565);
	if (resultIpl != stm32ipl_err_Ok)
	{
		Error_Handler();
	}

	while (1)
	{
		if (camera_state == CAM_STATE_SETUP)
		{
			/* Set camera resolution, format and rate from USB request */
			CAMERA_SetMode();

			/* Set frame width and height */
			JPEG_Init();

			camera_capture_complete = 0;

			const uint32_t line_size = camera_res_width * CAMERA_BITS_PER_PX / 8;
			const uint32_t num_lines = camera_res_height;
			/*
			 * Start the Camera Capture
			 * Using intermediate line buffer in D2-AHB domain to support high pixel clocks.
			 */
			if (HAL_DCMIEx_Start_DMA_MDMA(&hcamera_dcmi, CAMERA_MODE_CONTINUOUS, pCameraBuff, line_size, num_lines) != HAL_OK)
			{
				Error_Handler();
			}

			camera_state = CAM_STATE_CONFIGURED;
		}
		else if (camera_state == CAM_STATE_CONFIGURED)
		{
			/* Wait for new camera frame */
			while ((camera_capture_complete == 0) && (camera_state == CAM_STATE_CONFIGURED))
				;
			camera_capture_complete = 0;

			/*
			 * Copy pCameraBuff as the DCMI HAL doesn't support double-buffering.
			 * Inline double-word copy is faster than byte per byte copy provided with
			 * newlib-nano.
			 */
			//			for (uint32_t i = 0; i < camera_buf_size / sizeof(uint64_t); i++)
			//			{
			//				*(((uint64_t *) pCopiedBuff) + i) = *(((uint64_t *) pCameraBuff) + i);
			//			}

			for (uint32_t i = 0; i < camera_buf_size / sizeof(uint16_t); i++)
			{
				//*(((uint16_t *) pCopiedBuff) + i) = (uint16_t) 0b1111000000000000;// *(((uint16_t *) pCameraBuff) + i);

				*(((uint16_t *)pCopiedBuff) + i) = *(((uint16_t *)pCameraBuff) + i);
			}

			// memcpy(pCopiedBuff, pCameraBuff, sizeof(pCameraBuff));

			// apply STM32 IPL
			// stm32ipl_err_t resultIpl;

			// image_t imgSrc;
			// STM32Ipl_Init(&imgSrc, MAX_WIDTH, MAX_HEIGHT, IMAGE_BPP_RGB565, pCopiedBuff);

			// image_t imgDst;
			// resultIpl = STM32Ipl_AllocData(&imgDst, MAX_WIDTH, MAX_HEIGHT, IMAGE_BPP_RGB565);
			// if (resultIpl != stm32ipl_err_Ok)
			// {
			// 	Error_Handler();
			// }

			// image_t imgDst2;
			// resultIpl = STM32Ipl_AllocData(&imgDst2, MAX_WIDTH, MAX_HEIGHT, IMAGE_BPP_RGB565);
			// if (resultIpl != stm32ipl_err_Ok)
			// {
			// 	Error_Handler();
			// }

			resultIpl = STM32Ipl_CopyData(&imgSrc, &imgDst);
			if (resultIpl != stm32ipl_err_Ok)
			{
				Error_Handler();
			}

			// STM32Ipl_Binary(&imgDst, &imgDst, &thresholds, true, false, NULL);

			// STM32Ipl_MeanFilter(&imgSrc, 3, false, 0, false, NULL);

			// resultIpl = STM32Ipl_CopyData(&imgDst, &imgSrc);
			// if (resultIpl != stm32ipl_err_Ok)
			// {
			// 	Error_Handler();
			// }

			// STM32Ipl_ReleaseData(&imgDst);
			// STM32Ipl_ReleaseData(&imgDst2);

			if (camera_format == CAMERA_PF_RGB565)
			{
				uint32_t ycbcr_buf_size;
				ycbcr_buf_size = JPEG_RGBToYCbCr(pCopiedBuff, pYCbCrBuff);

				/* Wait for previous USB transmit to complete */
				while ((usb_tx_complete == 0) && (camera_state == CAM_STATE_CONFIGURED))
					;

				JPEG_Encode(pYCbCrBuff, pJpegBuff, ycbcr_buf_size);

				/* Set USB transmit parameters */
				usb_tx_buff = pJpegBuff;
				usb_tx_size = jpg_img_size;

				/* Trigger USB transmit start on next USB data IN stage */
				usb_tx_complete = 0;
			}
			else if (camera_format == CAMERA_PF_YUV422)
			{
				/* Set USB transmit parameters */
				usb_tx_buff = pCopiedBuff;
				usb_tx_size = camera_buf_size;

				/* Trigger USB transmit start on next USB data IN stage */
				usb_tx_complete = 0;
			}
		}
	}
}

/**
 * @brief Initialize USB Video
 *
 */
void USB_Init(void)
{
	HAL_PWREx_EnableUSBVoltageDetector();

	/* Init Device Library */
	if (USBD_Init(&husb, &VIDEO_Desc, 0) != USBD_OK)
	{
		Error_Handler();
	}

	/* Add Supported Class */
	if (USBD_RegisterClass(&husb, &USBD_VIDEO) != USBD_OK)
	{
		Error_Handler();
	}

	/* Add Interface Class */
	if (USBD_VIDEO_RegisterInterface(&husb, &USBD_VIDEO_fops) != USBD_OK)
	{
		Error_Handler();
	}

	/* Start Device Process */
	USBD_Start(&husb);
}

/**
 * @brief Initialize JPEG hardware encoder and utilities
 *
 */
void JPEG_Init(void)
{
	JPEG_ConfTypeDef jpeg_conf;
	uint32_t MCU_TotalNb;

	hjpeg.Instance = JPEG;
	if (HAL_JPEG_Init(&hjpeg) != HAL_OK)
	{
		Error_Handler();
	}

	/* Set JPEG encoding parameters */
	jpeg_conf.ColorSpace = JPEG_YCBCR_COLORSPACE;
	jpeg_conf.ChromaSubsampling = JPEG_SUBSAMPLING;
	jpeg_conf.ImageWidth = camera_res_width;
	jpeg_conf.ImageHeight = camera_res_height;
	jpeg_conf.ImageQuality = JPEG_QUALITY;
	if (HAL_JPEG_ConfigEncoding(&hjpeg, &jpeg_conf) != HAL_OK)
	{
		Error_Handler();
	}

	/* Initialize RGB to YCbCr color conversion tables */
	JPEG_InitColorTables();

	/* Retrieve the corresponding color conversion function and number of MCUs. */
	JPEG_GetEncodeColorConvertFunc(&jpeg_conf, &RGBToYCbCr, &MCU_TotalNb);
}

/**
 * @brief Convert image buffer into Minimum Coded Unit (MCU)
 *
 * Perform color space transformation, downsampling and block splitting.
 * @param pSrc pointer to source RGB565 image buffer
 * @param pDst pointer to destination YCbCr blocks buffer
 * @return uint32_t number of converted bytes
 */
uint32_t JPEG_RGBToYCbCr(uint8_t *pSrc, uint8_t *pDst)
{
	const uint32_t img_width = hjpeg.Conf.ImageWidth;
	const uint32_t img_height = hjpeg.Conf.ImageHeight;
	const uint32_t input_size = img_width * img_height * 2; /* 16-bpp */
	uint32_t n_ycbcr_blocks;
	uint32_t n_ycbcr_bytes;

	/* Convert RGB image to YCbCr MCU block */
	n_ycbcr_blocks = RGBToYCbCr(
		pSrc,			 /* pointer to input RGB888/ARGB8888 frame buffer */
		pDst,			 /* pointer to output YCbCr blocks buffer */
		0,				 /* index of the input buffer first block */
		input_size,		 /* number of bytes in the input buffer */
		&n_ycbcr_bytes); /* number of converted bytes */

	(void)n_ycbcr_blocks;

	return n_ycbcr_bytes;
}

/**
 * @brief Encode YCbCr blocks into JPEG
 *
 * @param pSrc pointer to source YCbCr blocks buffer
 * @param pDst pointer to the destination jpeg buffer
 * @param size size in bytes of the input buffer
 */
void JPEG_Encode(uint8_t *pSrc, uint8_t *pDst, uint32_t size)
{
	HAL_StatusTypeDef status;

	status = HAL_JPEG_Encode(&hjpeg, pSrc, size, pDst, JPEG_MAX_SIZE, 2000);
	if (status != HAL_OK)
	{
		Error_Handler();
	}
}

/**
 * @brief  JPEG error callback.
 * @param  hjpeg pointer to a JPEG_HandleTypeDef structure that contains
 *         the configuration information for JPEG module
 */
void HAL_JPEG_ErrorCallback(JPEG_HandleTypeDef *hjpeg)
{
	uint32_t error_code = HAL_JPEG_GetError(hjpeg);
	(void)error_code;
	Error_Handler();
}

/**
 * @brief  Decoded/Encoded Data ready  callback.
 * @param  hjpeg pointer to a JPEG_HandleTypeDef structure that contains
 *         the configuration information for JPEG module
 * @param  pDataOut pointer to the output data buffer
 * @param  OutDataLength number in bytes of data available in the specified output buffer
 */
void HAL_JPEG_DataReadyCallback(JPEG_HandleTypeDef *hjpeg, uint8_t *pDataOut, uint32_t OutDataLength)
{
	jpg_img_size = OutDataLength;
	if (OutDataLength > JPEG_MAX_SIZE)
	{
		Error_Handler();
	}
}

/**
 * @brief  Frame Event callback.
 * @param  Instance Camera instance.
 */
void BSP_CAMERA_FrameEventCallback(uint32_t Instance)
{
	camera_capture_complete = 1;
	BSP_LED_Toggle(LED1);
}

/**
 * @brief  Error callback.
 * @param  Instance Camera instance.
 */
void BSP_CAMERA_ErrorCallback(uint32_t Instance)
{
	Error_Handler();
}

/**
 * @brief Enables DCMI DMA request and enables DCMI capture
 *        with intermediate line buffer
 *
 * @param  hdcmi     pointer to a DCMI_HandleTypeDef structure that contains
 *                    the configuration information for DCMI.
 * @param  DCMI_Mode DCMI capture mode snapshot or continuous grab.
 * @param  pData     The destination memory Buffer address (Frame buffer).
 * @param line_size Horizontal frame size in bytes.
 * @param num_lines Vertical frame size in pixels.
 * @return HAL status
 */
HAL_StatusTypeDef HAL_DCMIEx_Start_DMA_MDMA(DCMI_HandleTypeDef *hdcmi, uint32_t DCMI_Mode, uint8_t *pData,
											uint32_t line_size, uint32_t num_lines)
{
	/* Check function parameters */
	assert_param(IS_DCMI_CAPTURE_MODE(DCMI_Mode));

	/* Process Locked */
	__HAL_LOCK(hdcmi);

	/* Lock the DCMI peripheral state */
	hdcmi->State = HAL_DCMI_STATE_BUSY;

	/* Enable DCMI by setting DCMIEN bit */
	__HAL_DCMI_ENABLE(hdcmi);

	/* Configure the DCMI Mode */
	hdcmi->Instance->CR &= ~(DCMI_CR_CM);
	hdcmi->Instance->CR |= (uint32_t)(DCMI_Mode);

