mclaughlinpeter/STM32/STM32_IPL/Core/Src/main.c
	/* Set DMA callbacks */
	hdcmi->DMA_Handle->XferCpltCallback = DCMI_DMALineXferCplt;
	hdcmi->DMA_Handle->XferErrorCallback = DCMI_DMAError;
	hdcmi->DMA_Handle->XferAbortCallback = NULL;

	/* Set MDMA callbacks */
	hmdma.XferCpltCallback = DCMI_MDMAFrameXferCplt;
	hmdma.XferErrorCallback = DCMI_MDMAError;

	hdcmi->XferCount = 0;
	hdcmi->XferTransferNumber = num_lines;
	hdcmi->XferSize = line_size / 4U;
	hdcmi->pBuffPtr = (uint32_t)pData;

	/* Enable the DMA Stream */
	uint32_t pLineData = (uint32_t)pCameraLineBuffer;
	if (HAL_DMA_Start_IT(hdcmi->DMA_Handle, (uint32_t)&hdcmi->Instance->DR, pLineData, hdcmi->XferSize) != HAL_OK)
	{
		/* Set Error Code */
		hdcmi->ErrorCode = HAL_DCMI_ERROR_DMA;
		/* Change DCMI state */
		hdcmi->State = HAL_DCMI_STATE_READY;
		/* Release Lock */
		__HAL_UNLOCK(hdcmi);
		/* Return function status */
		return HAL_ERROR;
	}

	/* Enable Capture */
	hdcmi->Instance->CR |= DCMI_CR_CAPTURE;

	/* Release Lock */
	__HAL_UNLOCK(hdcmi);

	/* Return function status */
	return HAL_OK;
}

/**
 * @brief  DMA transfer complete callback.
 * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
 *                the configuration information for the specified DMA module.
 * @retval None
 */
static void DCMI_DMALineXferCplt(DMA_HandleTypeDef *hdma)
{
	DCMI_HandleTypeDef *hdcmi = (DCMI_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

	/* Copy line buffer to frame buffer using MDMA */
	uint32_t line_size = hdcmi->XferSize * 4U;
	uint8_t *pDst = (uint8_t *)hdcmi->pBuffPtr + line_size * hdcmi->XferCount;

	if (HAL_MDMA_Start_IT(&hmdma, (uint32_t)pCameraLineBuffer, (uint32_t)pDst, line_size, 1) != HAL_OK)
	{
		Error_Handler();
	}
}

/**
 * @brief  MDMA DCMI transfer complete callback
 * @param  hmdma  MDMA handle
 * @retval None
 */
static void DCMI_MDMAFrameXferCplt(MDMA_HandleTypeDef *hmdma)
{

	DCMI_HandleTypeDef *hdcmi = &hcamera_dcmi;

	/* Disable the MDMA channel */
	__HAL_MDMA_DISABLE(hmdma);

	hdcmi->XferCount++;

	/* Check if the frame is transferred */
	if (hdcmi->XferCount == hdcmi->XferTransferNumber)
	{
		/* Enable the Frame interrupt */
		__HAL_DCMI_ENABLE_IT(hdcmi, DCMI_IT_FRAME);

		/* When snapshot mode, set dcmi state to ready */
		if ((hdcmi->Instance->CR & DCMI_CR_CM) == DCMI_MODE_SNAPSHOT)
		{
			hdcmi->State = HAL_DCMI_STATE_READY;
		}
		else
		{
			hdcmi->XferCount = 0;
		}
	}
}

/**
 * @brief  DMA error callback
 * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
 *                the configuration information for the specified DMA module.
 * @retval None
 */
static void DCMI_DMAError(DMA_HandleTypeDef *hdma)
{
	DCMI_HandleTypeDef *hdcmi = (DCMI_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

	if (hdcmi->DMA_Handle->ErrorCode != HAL_DMA_ERROR_FE)
	{
		/* Initialize the DCMI state*/
		hdcmi->State = HAL_DCMI_STATE_READY;

		/* Set DCMI Error Code */
		hdcmi->ErrorCode |= HAL_DCMI_ERROR_DMA;
	}

	Error_Handler();
}

/**
 * @brief  MDMA DCMI error callback.
 * @param  hmdma MDMA handle
 * @retval None
 */
static void DCMI_MDMAError(MDMA_HandleTypeDef *hmdma)
{
	/* Disable the MDMA channel */
	__HAL_MDMA_DISABLE(hmdma);

	Error_Handler();
}

/**
 * @brief Initialize Master DMA
 *
 */
void MDMA_Init(void)
{
	__HAL_RCC_MDMA_CLK_ENABLE();

	hmdma.Instance = MDMA_Channel0;
	hmdma.Init.Request = MDMA_REQUEST_SW;
	hmdma.Init.TransferTriggerMode = MDMA_BLOCK_TRANSFER;
	hmdma.Init.Priority = MDMA_PRIORITY_HIGH;
	hmdma.Init.Endianness = MDMA_LITTLE_ENDIANNESS_PRESERVE;
	hmdma.Init.SourceInc = MDMA_SRC_INC_WORD;
	hmdma.Init.DestinationInc = MDMA_DEST_INC_WORD;
	hmdma.Init.SourceDataSize = MDMA_SRC_DATASIZE_WORD;
	hmdma.Init.DestDataSize = MDMA_DEST_DATASIZE_WORD;
	hmdma.Init.DataAlignment = MDMA_DATAALIGN_PACKENABLE;
	hmdma.Init.SourceBurst = MDMA_DEST_BURST_SINGLE;
	hmdma.Init.DestBurst = MDMA_DEST_BURST_16BEATS;
	hmdma.Init.BufferTransferLength = 128;
	hmdma.Init.SourceBlockAddressOffset = 0;
	hmdma.Init.DestBlockAddressOffset = 0;
	if (HAL_MDMA_Init(&hmdma) != HAL_OK)
	{
		Error_Handler();
	}

	/* NVIC configuration for MDMA transfer complete interrupt */
	HAL_NVIC_SetPriority(MDMA_IRQn, 15U, 0);
	HAL_NVIC_EnableIRQ(MDMA_IRQn);
}

/**
 * @brief Set camera resolution, format and rate
 *
 */
void CAMERA_SetMode(void)
{
	const uint32_t resolution = camera_res;
	const uint32_t format = camera_format;
	uint32_t camera_id;

	camera_id = Camera_Ctx[0].CameraId;

	if ((camera_id == OV9655_ID) || (camera_id == OV9655_ID_2))
	{
		/* Full camera DeInit-Init to for color noise issue workaround */
		BSP_CAMERA_DeInit(0);
		if (BSP_CAMERA_Init(0, resolution, format) != BSP_ERROR_NONE)
		{
			Error_Handler();
		}
	}
	else if (camera_id == OV5640_ID)
	{
		BSP_CAMERA_SetResolution(0, resolution);
		BSP_CAMERA_SetPixelFormat(0, format);
	}

	/*
	 * Adjust camera frame rate to:
	 * - 12fps in VGA UNCOMPRESSED mode to match USB bandwidth
	 * - 15fps in VGA MJPEG mode to allow for JPEG processing time
	 * - 30fps in QVGA UNCOMPRESSED and MJPEG modes (OV5640 only)
	 * Note: Camera frame rate should match USB descriptor.
	 */
	if ((format == CAMERA_PF_YUV422) && (resolution == CAMERA_R640x480))
	{
		BSP_CAMERAEx_SetTiming(0, CAMERA_TIMING_12FPS);
	}
	else if ((format == CAMERA_PF_RGB565) && (resolution == CAMERA_R640x480))
	{
		BSP_CAMERAEx_SetTiming(0, CAMERA_TIMING_15FPS);
	}
	else
	{
		BSP_CAMERAEx_SetTiming(0, CAMERA_TIMING_30FPS);
	}
}

/**
 * @brief  System Clock Configuration
 *         The system Clock is configured as follow :
 *            System Clock source            = PLL (HSE)
 *            SYSCLK(Hz)                     = 400000000 (Cortex-M7 CPU Clock)
 *            HCLK(Hz)                       = 200000000 (Cortex-M4 CPU, Bus matrix Clocks)
 *            AHB Prescaler                  = 2
 *            D1 APB3 Prescaler              = 2 (APB3 Clock  100MHz)
 *            D2 APB1 Prescaler              = 2 (APB1 Clock  100MHz)
 *            D2 APB2 Prescaler              = 2 (APB2 Clock  100MHz)
 *            D3 APB4 Prescaler              = 2 (APB4 Clock  100MHz)
 *            HSE Frequency(Hz)              = 25000000
 *            PLL_M                          = 5
 *            PLL_N                          = 160
 *            PLL_P                          = 2
 *            PLL_Q                          = 4
 *            PLL_R                          = 2
 *            VDD(V)                         = 3.3
 *            Flash Latency(WS)              = 4
 * @param  None
 * @retval None
 */
static void SystemClock_Config(void)
{
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_OscInitTypeDef RCC_OscInitStruct;
	HAL_StatusTypeDef ret = HAL_OK;

